<?php

use Illuminate\Database\Seeder;

class RiskStrategiesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('risk_strategies')->insert([
            'symbol' => 'ยอมรับ',
            'name' => 'การยอมรับความเสี่ยง ',
            'detail' => 'การยอมรับให้มีความเสี่ยงปรากฏอยู่ เป็นความเสี่ยงที่หน่วยงานสามารถยอมรับได้เนื่องจากมีกิจกรรมการควบคุมภายในที่ดีอยู่แล้ว เนื่องจากการดำเนินการในการจัดการกับความเสี่ยง ไม่มีความคุ้มค่าเพียงพอ หรือทรัพยากรมีไม่เพียงพอต่อการดำเนินการในปีงบประมาณ ',
            'created_by' => '1',
            'created_at' => new DateTime,
            'updated_by' => '1',
            'updated_at' => new DateTime,
        ]);
        DB::table('risk_strategies')->insert([
            'symbol' => 'ลด',
            'name' => 'การลด/การควบคุมความเสี่ยง  ',
            'detail' => 'การลดโอกาสในการเกิดความเสี่ยง และ/ หรือความรุนแรงของผลกระทบที่เกิดขึ้นโดยหาวิธีการเพิ่มเติมเพื่อจัดการความเสี่ยง เช่น การออกแบบระบบการควบคุมภายใน ปรับปรุงแก้ไขกระบวนการ การตรวจติดตาม การจัดทำแผนฉุกเฉิน การจัดทำมาตรฐานความปลอดภัย การฝึกอบรมเพื่อพัฒนาทักษะ เป็นต้น',
            'created_by' => '1',
            'created_at' => new DateTime,
            'updated_by' => '1',
            'updated_at' => new DateTime,
        ]);
        DB::table('risk_strategies')->insert([
            'symbol' => 'ถ่ายโอน',
            'name' => 'การกระจายความเสี่ยง',
            'detail' => 'การกระจาย หรือโอนความเสี่ยงทั้งหมดหรือเพียงบางส่วนไปยังผู้อื่นที่มั่นใจว่าสามารถควบคุมความเสี่ยงนั้นได้เป็นอย่างดี ทั้งนี้เพื่อลดความสูญเสียที่อาจเกิดขึ้น เช่น การทำประกันภัย การจ้างบุคคลภายนอกดำเนินการแทน เป็นต้น',
            'created_by' => '1',
            'created_at' => new DateTime,
            'updated_by' => '1',
            'updated_at' => new DateTime,
        ]);
        DB::table('risk_strategies')->insert([
            'symbol' => 'หลีกเลี่ยง',
            'name' => 'การหลีกเลี่ยงความเสี่ยง ',
            'detail' => 'การหลีกเลี่ยงเหตุการณ์ที่ก่อให้เกิดความเสี่ยง เช่น การหยุดดำเนินกิจกรรมการเปลี่ยนแปลงวัตถุประสงค์หรือเปลี่ยนแปลงกิจกรรมที่เป็นความเสี่ยง การปรับเปลี่ยนรูปแบบการทำงาน การลดขนาดของงานหรือกิจกรรมที่จะดำเนินการลง หรือเลือกกิจกรรมอื่นที่สามารถยอมรับได้มากกว่า เป็นต้น',
            'created_by' => '1',
            'created_at' => new DateTime,
            'updated_by' => '1',
            'updated_at' => new DateTime,
        ]);
    }
}
